Autodesk.Revit.DB.ExternalResourceServiceUtils.GetServersByType(Autodesk.Revit.DB.ExternalResourceType)
Gets registered external resource servers which support the external resource type.
type:
The external resource type for the servers to match
Returns:
A list of matched external resource servers
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015